public class Task4 {
//    Данная последовательность: [((())()(())]] не является правильной. Чтобы сделать её правильной,
//    необходимо убедиться, что каждая открывающая скобка соответствует своей закрывающей скобке и наоборот.
//    Проблема здесь в том, что 2ой слева символ в последовательности является круглой скобкой, а 2ой справа - квадратной.
//
//    Для исправления этой последовательности можно сделать следующее:
//    заменить первую круглую скобку на квадратную или заменить вторую квадратную скобку на круглую, вот так:
//    [((())()(()))]
//    [[(())()(())]].
}
